# Run `brew bundle` to install all packages listed below. Search for packages at https://brew.sh/.
# Refer to https://github.com/Homebrew/homebrew-bundle for details on `brew bundle`.

# Same as running `brew tap (...)`
tap "hashicorp/tap" # To install Terraform's latest version | https://developer.hashicorp.com/terraform/install

# Same as running `brew install (...)`
brew "awscli" # CLI to manage AWS services | https://aws.amazon.com/cli/
brew "bat" # Modern alternative to `cat` | https://github.com/sharkdp/bat
brew "chezmoi" # Manage dotfiles/configurations across multiple systems | https://www.chezmoi.io/
brew "cosign" # Increase supply chain security via code signing and transparency for containers and binaries | https://github.com/sigstore/cosign
brew "universal-ctags" # Generate an index/tag file of language objects in source files. I use it within Neovim | https://ctags.io/
brew "devcontainer" # Development containers | https://containers.dev/
brew "direnv" # Automatically load ENV variables when you `cd` into a directory | https://direnv.net/
# TODO: Somehow, the binaries from this package cannot be found in $PATH when using devcontainers...
# brew "docker-credential-helper" # Keep Docker login credentials safe by storing in platform keystores | https://github.com/docker/docker-credential-helpers
brew "eza" # Modern alternative to `ls` | https://eza.rocks/
brew "fd" # Modern alternative to `fd` | https://github.com/sharkdp/fd
brew "fzf" # Fuzzy finder | https://github.com/junegunn/fzf
brew "gh" # GitHub CLI | https://cli.github.com/
brew "git-delta" # Syntax-highlighting pager for git | https://github.com/dandavison/delta
brew "git-lfs" # Git extension for large file storage | https://git-lfs.com/
brew "gum" # Tool for glamorous shell scripts | https://github.com/charmbracelet/gum
brew "hashicorp/tap/nomad" # Scheduler and orchestrator to deploy and manage containers | https://www.nomadproject.io/
brew "hashicorp/tap/terraform" # Infrastructure as Code tool | https://www.terraform.io/
brew "hashicorp/tap/vault" # Manage secrets and protect sensitive data | https://www.vaultproject.io/
brew "hyperfine" # Command-line benchmarking tool | https://github.com/sharkdp/hyperfine
brew "jq" # CLI JSON processor | https://jqlang.org/
brew "lf" # Terminal file manager | https://github.com/gokcehan/lf
brew "luarocks" # Package manager for the Lua programming language. I use it within Neovim | https://luarocks.org/
brew "mise" # Polyglot tool version manager | https://mise.jdx.dev/
brew "neovim" # Text editor | https://neovim.io/
brew "rclone" # CLI to manage files on cloud storage | https://rclone.org/
brew "ripgrep" # Search tool | https://github.com/BurntSushi/ripgrep
brew "shellcheck" # Static analysis and linting for shell scripts | https://www.shellcheck.net/
brew "slsa-verifier" # Increase supply chain security by verifying provenance from SLSA compliant builders | https://github.com/slsa-framework/slsa-verifier
brew "starship" # Customizable prompt for any shell | https://starship.rs/
brew "tlrc" # Collaborative cheatsheets for CLI tools | https://github.com/tldr-pages/tlrc
brew "tree" # Display directories as trees | https://oldmanprogrammer.net/source.php?dir=projects/tree
